In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('my_data.csv')

df

     Date  Product  Price  Units
0  1/1/22   Apples   0.50     10
1  1/2/22  Bananas   0.25     20
2  1/3/22  Oranges   0.75     15
3  1/4/22   Apples   0.60     12
4  1/5/22  Bananas   0.30     18
5  1/6/22  Oranges   0.80     20

In [21]:
subset_df = df[["Price", "Units"]]
subset_df

KeyError: "['Units'] not in index"

In [ ]:
units_column = df[["Units"]]
units_column

In [ ]:
first_3_rows = df.loc[0:2] # These slices are inclusive
first_3_rows
first_3_rows_sales_data = df.loc[0:2,['Price', 'Units']] #syntax df.loc[rows, columns]
first_3_rows_sales_data

In [ ]:
saless = df.iloc[0:3, 2:4] # Exclusive this time
saless

In [ ]:
peso_prices = []

for price in df['Price']:
    peso_prices.append(price * 55)

df['Price'] = peso_prices
df

In [ ]:
df['Total'] = df['Price'] * df['Units']
df

In [ ]:
df = df.rename(columns={'Units':'Quantity'})
df

In [ ]:
uppercase_products = []

for product in df['Product']:
    uppercase_products.append(product.upper())

df['Product'] = uppercase_products
df

In [ ]:
df['Product'] = df['Product'].str.lower()
df

In [ ]:
def multiply(index,multiplier):
    number = index * multiplier
    return number

In [ ]:
df['Price'] = df['Price'].apply(multiply, multiplier = 2)
df

In [ ]:
df['expensive'] = df['Price'] > 60
df

In [22]:
df[df['expensive']]

     Date  Product  Price  Quantity   Total  expensive
2  1/3/22  oranges   82.5        15  618.75       True
3  1/4/22   apples   66.0        12  396.00       True
5  1/6/22  oranges   88.0        20  880.00       True

In [23]:
expensive_quantity = df.loc[df['expensive'], 'Quantity'].sum()
expensive_quantity

np.int64(47)

In [24]:
expensive_sold = df.loc[df['expensive'], 'Total'].sum()
expensive_sold

np.float64(1894.75)

In [31]:
df_products = df.groupby('Product').sum()
df_products

                 Date  Price  Quantity    Total  expensive
Product
apples   1/1/221/4/22  121.0        22   671.00          1
bananas  1/2/221/5/22   60.5        38   572.00          0
oranges  1/3/221/6/22  170.5        35  1498.75          2

     Date  Product  Price  Quantity   Total  expensive
0  1/1/22   apples   55.0        10  275.00      False
1  1/2/22  bananas   27.5        20  275.00      False
2  1/3/22  oranges   82.5        15  618.75       True
3  1/4/22   apples   66.0        12  396.00       True
4  1/5/22  bananas   33.0        18  297.00      False
5  1/6/22  oranges   88.0        20  880.00       True